package 글;
import java.util.Scanner;
public class 스토리1 {

	public 스토리1() {

		Scanner scanner = new Scanner(System.in);
		System.out.println();
		System.out.println("=============================");
		System.out.println("      프로그램을 시작합니다.");
		System.out.println();
		System.out.println("Enter 입력시 다음내용이 출력됩니다. ");
		System.out.println("=============================");
		scanner.nextLine();
		System.out.println("⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑🇰🇷🇰🇷🇰🇷⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑");
		System.out.println("⚑");
		System.out.println("⚑  스토리 🔈  ");
		System.out.println("⚑ ");
		System.out.println("⚑ 현재시간 2040년 4월24일. 내 이름은 유진.. 박사이다.");
		System.out.println("⚑ 2038년 7월에 발생했던 '박테리오파지 N-41' 바이러스가 퍼진 이후로 부터 현재 세계 사람들은 그것으로 변화되었다.");
		System.out.println("⚑ 우리는 그것을 좀비라 부른다..");
		System.out.println("⚑ 2040년 4월24일인 오늘 마침내 나는 백신제조에 성공하였다. ");
		System.out.println("⚑ 하지만 재료가 부족하여 백신의 양은 극소수.. 이것으로는 턱이 없다.");
		System.out.println("⚑ 우리는 말레이시아 🇲🇾 에 위치해 있는 한 의료센터에서 백신을 대량으로 생산할 수 있는 장비가 있다는 것을 확인하였다");
		System.out.println("⚑ 문제는 말레이시아 🇲🇾가 경계위험도 A급 지역이라는 것이다.. ");
		System.out.println("⚑ 방도는 없다, 이 백신을 만들 수 있는 것은 나 하나뿐 생존자도 몇 남지 않았다.");
		System.out.println("⚑ 내가 직접 그 길을 나설 수 밖에는..");
		System.out.println("⚑");
		System.out.println("⚑");
		System.out.println("⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑⚑");
		System.out.println();
		System.out.println("박사가 헬리콥터에 탑승하는 중... 쓰레드 구현");
		System.out.println("Please Press the Enter Key");
		// 쓰레드 구현 : 박사가 헬리콥터에 탑승하는 중......
		scanner.nextLine();
		System.out.println("👤 헬리콥터 조종사 : 박사님 !	A급 지역에 도착하였습니다!");
		System.out.println("👤 헬리콥터 조종사 : 목표 지점까지 20분 남았습니다.");
		System.out.println();
		System.out.println("👨🏻‍⚕️ 유진 박사 : 그렇구만 끝까지 수고 해주시게!");
		System.out.println(" 밑을 바라본다...");
		System.out.println();
		System.out.println("👨🏻‍⚕️ 유진 박사 : 엄청난 수의 감염자들이구만.. 지옥을 보는 것만 같아..");
		System.out.println();
		System.out.println("어디선가 헬리콥터를 향해 돌덩어리가 날라온다..");
		System.out.println("맞았다 추락한다..");
		System.out.println("👤 헬리콥터 조종사 : 비상!! 비상!! 알 수 없는 무언가에 맞아 헬리콥터가 손상을 입어 추락합니다!!");
		System.out.println("👤 헬리콥터 조종사 : 낙하산을 피셔야 합니다!!");

	}
}

