package 글;

public class 아이템_글3 {

	public 아이템_글3() {

		System.out.println("'투척물'을 선택하셨습니다.");
		System.out.println();
		System.out.println("💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨");
		System.out.println("💣🧨");
		System.out.println("💣🧨 1.돌맹이  ✔︎  피해 : - 15");
		System.out.println("💣🧨 💎필요물품 : [토끼 1마리 처치], [헌터 처치]");
		System.out.println("💣🧨");
		System.out.println("💣🧨 2.독침  ✔︎ 피해 - 20; , ✔︎ 크리티컬 + 5");
		System.out.println("💣🧨 💎필요물품 : [멧돼지의 송곳니 1개], [전갈의 독 2개], [부머 처치]");
		System.out.println("💣🧨");
		System.out.println("💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨💣🧨");
		System.out.println("무기를 선택해주세요 : ");	
	}
}
