package 글;

public class 아이템_글2 {

	public 아이템_글2 () {
		System.out.println("'둔기'를 선택하셨습니다.️");
		System.out.println("️");
		System.out.println("🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️️");
		System.out.println("🔱⚜️");
		System.out.println("🔱⚜️ 1. 사슴의 창  ✔︎ 공격력 : + 8 , ✔︎ 크리티컬 + 2️");
		System.out.println("🔱⚜️ 💎필요물품 : [사슴의 뿔 2개], [토끼의 가죽 1개], [좀비 2마리 처치]");
		System.out.println("🔱⚜️");
		System.out.println("🔱⚜️ 2. 노루의 창 ✔︎ 공격력 : + 10 , ✔︎ 크리티컬 + 4️");
		System.out.println("🔱⚜ 💎필요물품 : [노루의 뿔 2개], [멧돼지의 가죽 1개],[토끼의 가죽 1개], [좀비 2마리 처치]️");
		System.out.println("🔱⚜️");
		System.out.println("🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️🔱⚜️");
		System.out.println("무기를 선택해주세요 : ");
	}
}
