package 글;

public class 아이템_글 {

	 public 아이템_글() {
		System.out.println("'근접무기'를 선택하셨습니다.");
		System.out.println();
		System.out.println("🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡");
		System.out.println("🔪🗡");
		System.out.println("🔪🗡 1.송곳니 나이프  ✔︎ 공격력 : + 4");
		System.out.println("🔪🗡 💎필요물품 : [멧돼지의 송곳니 1개], [멧돼지의 가죽 1개], [좀비 1마리 처치]");
		System.out.println("🔪🗡");
		System.out.println("🔪🗡 2.독 송곳니 나이프  ✔︎ 공격력 : + 5 , ✔︎ 크리티컬 + 2");
		System.out.println("🔪🗡 💎필요물품 : [멧돼지의 송곳니 1개], [멧돼지의 가죽 1개], [전갈의 독 1개], [좀비 2마리 처치]");
		System.out.println("🔪🗡");
		System.out.println("🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡🔪🗡");
		System.out.println("무기를 선택해주세요 : ");
	}
	
	 }

